#pragma once
#ifndef VYCHISL_H
#define VYCHISL_H
/*31. Дан прямоугольник размером 647 x 170. Сколько квадратов со стороной 30
можно вырезать из него ?*/
void func31();
/*36. Пользователь вводит номер месяца, вывести название месяца.*/
void func36();
/*43. Пользователь вводит номер месяца. Вывести название поры года
(весна, лето и т.д.)*/
void func43();
/*48. Даны три числа. Найдите те два из них, сумма которых наибольшая.*/
void func48();
/*59. Дано четырехзначное число. Верно ли, что цифр в нем расположены по
убыванию?Например, 4311 - нет, 4321 - да, 5542 - нет, 5631 - нет, 9871 - да.*/
void func59();
/*60. Дано трехзначное число. Переставьте первую и последнюю цифры.*/
void func60();
/*62. Дано пятизначное число. Цифры на четных позициях занулить. Например, из
12345 получается число 10305.*/
void func62();
/*65. Дано четырехзначное число. Переставьте местами цифры так, чтобы сначала
оказались цифры, меньшие пяти.*/
void func65();
#endif // !VYCHISL_H
